{"format": "graph-model", "generatedBy": "2.13.1", "convertedBy": "TensorFlow.js Converter v4.14.0", "signature": {"inputs": {"token_ids:0": {"name": "token_ids:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "segment_ids:0": {"name": "segment_ids:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "padding_mask:0": {"name": "padding_mask:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"logits": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_layer_norm/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Gelu/add_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Gelu/mul_2/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Gelu/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_intermediate_dense/Gelu/Pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_output_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer_norm/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/sub/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/value/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_layer_norm/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Gelu/add_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Gelu/mul_2/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Gelu/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_intermediate_dense/Gelu/Pow/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_output_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer_norm/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/sub/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/value/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/attention_output/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/size/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30522"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/token_embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/packed/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/segment_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer_norm/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer_norm/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer_norm/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer_norm/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_layer_norm/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_layer_norm/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_layer_norm/batchnorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/feedforward_layer_norm/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer_norm/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer_norm/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer_norm/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer_norm/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_layer_norm/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_layer_norm/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_layer_norm/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/feedforward_layer_norm/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/pooled_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/tf.__operators__.getitem/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/tf.__operators__.getitem/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/tf.__operators__.getitem/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/logits/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/logits/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "padding_mask", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "segment_ids", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "token_ids", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/ExpandDims", "op": "ExpandDims", "input": ["padding_mask", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/ExpandDims/dim"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/ExpandDims", "op": "ExpandDims", "input": ["padding_mask", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/segment_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_1", "segment_ids", "StatefulPartitionedCall/bert_classifier/bert_backbone/segment_embedding/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/token_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "token_ids", "StatefulPartitionedCall/bert_classifier/bert_backbone/token_embedding/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/ExpandDims", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/ExpandDims", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/token_embedding/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/ExpandDims"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/ExpandDims"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Shape", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Shape", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/sub", "op": "Sub", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/sub/x", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/sub", "op": "Sub", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/sub/x", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/size", "op": "Pack", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/size/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/packed", "op": "Pack", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/strided_slice_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/packed/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/mul", "op": "Mul", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/sub", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_1/self_attention_layer/softmax/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/mul", "op": "Mul", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/sub", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/softmax/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice", "op": "Slice", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/ReadVariableOp", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/begin", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/Slice", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/packed"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/add/add", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/token_embedding/embedding_lookup", "StatefulPartitionedCall/bert_classifier/bert_backbone/position_embedding/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/add/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/add/add", "StatefulPartitionedCall/bert_classifier/bert_backbone/segment_embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/add/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/add/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/SquaredDifference", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/variance", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/Rsqrt", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/moments/mean", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/add/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/ReadVariableOp", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/mul_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/einsum/Einsum/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/einsum/Einsum/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/embeddings_layer_norm/batchnorm/add_1", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/value/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/add", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/einsum/Einsum", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/key/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/add", "op": "AddV2", "input": ["StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/einsum/Einsum", "StatefulPartitionedCall/bert_classifier/bert_backbone/transformer_layer_0/self_attention_layer/query/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 